Revit 2027 API
BuiltInFailures.StructuralAssetFailures Class
 Failures related to structural materials.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.StructuralAssetFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class StructuralAssetFailures
Public NotInheritable Class StructuralAssetFailures
public ref class StructuralAssetFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type StructuralAssetFailures = class end
The BuiltInFailures.StructuralAssetFailures type exposes the following members.
Properties
Name | Description
StructuralMaterialAssetInvalid |  Material assigned to the Analytical Element does not contain Structure parameters - verify material content.
Top
See Also
Reference
Autodesk.Revit.DB Namespace